/* error dialog default title */
TIME_MACHINE_ERROR = "Time Machine não conseguiu concluir a cópia de segurança.";

/* error dialog buttons */
OK = "OK";
PREFERENCES = "Abrir preferências do Time Machine…";

/* string which is shown instead of the _SHOWPREFS message for managed prefs configurations */
MANAGED_PREFS = "As definições do Time Machine neste computador são controladas pelas preferências geridas - contacte o seu administrador do sistema.";

/* error messages - shared with TMPref pane*/

// NO_ERROR
RESULTCODE_0_MESSAGE = "Erros inexistentes.";

// BACKUP_FAILED_LAUNCH
RESULTCODE_1_MESSAGE = "Não foi possível abrir o Time Machine.";  

// BACKUP_FAILED_SETUP
RESULTCODE_2_MESSAGE = "Não foi possível concluir a cópia de segurança. Ocorreu um erro ao criar a pasta da cópia de segurança."; 

// BACKUP_FAILED_TARGETVOL_UNSUPPORTED_FS
RESULTCODE_3_MESSAGE = "O disco da cópia de segurança não está no formato Mac OS Expandido (com registo) necessário.\n\n%@"; 
RESULTCODE_3_SHOWPREFS = "Abra as preferências do Time Machine para seleccionar outro disco de cópia de segurança.";

// BACKUP_FAILED_TARGETVOL_STATFS_FAILED
RESULTCODE_4_MESSAGE = "Não foi possível obter o estado do disco da cópia de segurança."; 

// BACKUP_FAILED_TARGETVOL_OWNERS_DISABLED
RESULTCODE_5_MESSAGE = "O disco da cópia de segurança não tem a característica de propriedade activada. Esta tem de estar activa para poder utilizar este disco para efectuar cópias de segurança do Time Machine.\n\n%@"; 
RESULTCODE_5_SHOWPREFS = "Abra as preferências do Time Machine para seleccionar outro disco de cópia de segurança.";

// BACKUP_FAILED_TARGETVOL_NOT_JOURNALED
RESULTCODE_6_MESSAGE = "O disco da cópia de segurança não está no formato Mac OS Expandido (com registo) necessário.\n\n%@";
RESULTCODE_6_SHOWPREFS = "Abra as preferências do Time Machine para seleccionar outro disco de cópia de segurança."; 

// BACKUP_FAILED_TARGETVOL_DISK_SPACE
RESULTCODE_7_MESSAGE = "Esta cópia de segurança é demasiado grande para o disco de cópia de segurança. A cópia de segurança requer %@, mas só estão disponíveis %@.\n\n%@";
RESULTCODE_7_SHOWPREFS = "O Time Machine precisa de espaço de trabalho no disco de cópia de segurança, além do espaço necessário para armazenar as cópias de segurança. Abra as preferências do Time Machine para seleccionar um disco de cópia de segurança com maior capacidade, ou elimine alguns ficheiros para reduzir o tamanho da cópia de segurança."; 

// BACKUP_FAILED_TARGETVOL_READONLY
RESULTCODE_8_MESSAGE = "Não é possível copiar os ficheiros para o disco de cópia de segurança, porque este parece ser “só de leitura”.\n\n%@";
RESULTCODE_8_SHOWPREFS = "Poderá ser necessário reparar ou reformatar o disco com o Utilitário do Disco. Caso não seja possível reparar o disco, é necessário utilizar um disco diferente para cópias de segurança. Abra as preferências do Time Machine, para seleccionar um disco de cópia de segurança diferente."; 

// BACKUP_FAILED_TARGETVOL_ACLS_DISABLED
RESULTCODE_9_MESSAGE = "O disco da cópia de segurança não tem activadas as Listas de Controlo de Acesso necessárias.\n\n%@";
RESULTCODE_9_SHOWPREFS = "Abra as preferências do Time Machine para seleccionar outro disco de cópia de segurança."; 

// BACKUP_FAILED_PREFLIGHT_STAGE
RESULTCODE_10_MESSAGE = "Ocorreu um erro ao preparar a cópia de segurança."; 

// BACKUP_FAILED_COPY_STAGE
RESULTCODE_11_HEADER = "A cópia de segurança não foi efectuada, porque ocorreu um erro ao copiar os ficheiros para o disco de cópia de segurança.";
RESULTCODE_11_MESSAGE = "O problema pode ser temporário. Tente efectuar a cópia de segurança de novo mais tarde. Se o problema persistir, utilize o Utilitário do Disco para reparar o disco de cópia de segurança.";

// BACKUP_FAILED_LINK_SOURCE
RESULTCODE_12_MESSAGE = "Ocorreu um erro ao associar os ficheiros no disco de cópia de segurança."; 

//  BACKUP_FAILED_TOO_MUCH_ACTIVITY
RESULTCODE_13_MESSAGE = "Foram alterados demasiados ficheiros durante a cópia de segurança."; 

// BACKUP_FAILED_SNAPSHOT_DELETE_FAILED 
RESULTCODE_14_MESSAGE = "Ocorreu um erro durante a tentativa de remover as cópias de segurança caducadas do disco de cópia de segurança.";

// BACKUP_FAILED_CULLING_DISABLED
RESULTCODE_15_MESSAGE = "Todas as cópias de segurança caducadas foram removidas, mas o disco da cópia de segurança continua cheio.\n\n%@";
RESULTCODE_15_SHOWPREFS = "Abra as preferências do Time Machine para seleccionar um disco de cópia de segurança com maior capacidade.";

// BACKUP_FAILED_CULLING_DATELIMIT
RESULTCODE_16_MESSAGE = "Todas as cópias de segurança caducadas foram removidas, mas o disco da cópia de segurança continua cheio.\n\n%@";
RESULTCODE_16_SHOWPREFS = "Abra as preferências do Time Machine para seleccionar um disco de cópia de segurança com maior capacidade."; 

// BACKUP_FAILED_TARGETVOL_NOT_SPECIFIED
RESULTCODE_17_MESSAGE = "Não foi seleccionado nenhum disco de cópia de segurança.\n\n%@";
RESULTCODE_17_SHOWPREFS = "Abra as preferências do Time Machine para seleccionar um disco de cópia de segurança.";

// BACKUP_FAILED_TARGETVOL_NOT_FOUND
RESULTCODE_18_MESSAGE = "Não foi possível encontrar o disco da cópia de segurança.\n\n%@";
RESULTCODE_18_SHOWPREFS = "Certifique-se de que o disco da cópia de segurança está ligado, ou abra as preferências do Time Machine para seleccionar outro disco de cópia de segurança."; 

// BACKUP_FAILED_TARGETVOL_NOT_MOUNTED
RESULTCODE_19_MESSAGE = "O disco de cópia de segurança não está disponível."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_CREATED
RESULTCODE_20_MESSAGE = "Não foi possível criar a imagem do disco da cópia de segurança “%@” (erro %@)."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_MOUNTED
RESULTCODE_21_MESSAGE = "Não foi possível aceder à imagem do disco da cópia de segurança “%@” (erro %@)."; 

// BACKUP_CANCELED
RESULTCODE_22_MESSAGE = "Cópia de segurança cancelada."; 

// BACKUP_FAILED_CASE_SENSITIVITY
RESULTCODE_23_MESSAGE = "Está a efectuar a cópia de segurança de um disco com distinção entre maiúsculas e minúsculas, mas o disco da cópia de segurança não faz essa distinção.\n\n%@";
RESULTCODE_23_SHOWPREFS = "Abra as preferências do Time Machine para seleccionar outro disco de cópia de segurança, ou para escolher não efectuar a cópia de segurança do disco com distinção entre maiúsculas e minúsculas."; 

// BACKUP_FAILED_DUPLICATE_VOLNAMES
RESULTCODE_24_MESSAGE = "Dois dos discos para os quais estão a ser efectuadas cópias de segurança têm o mesmo nome. Altere o nome de um deles."; 

// BACKUP_FAILED_NO_SOURCE_VOLUMES
RESULTCODE_25_MESSAGE = "Não há discos disponíveis para cópia de segurança. Esta situação pode ocorrer, se todos os discos estiverem na lista “Não efectuar cópia de segurança”.\n\n%@";
RESULTCODE_25_SHOWPREFS = "Para editar a lista, abra as preferências do Time Machine e clique em Opções.";

// BACKUP_FAILED_NETWORK_INTERRUPTION
RESULTCODE_26_HEADER = "Time Machine não conseguiu concluir a cópia de segurança devido a um problema na rede.";
RESULTCODE_26_MESSAGE = "Certifique-se de que o computador e o disco da cópia de segurança se encontram na mesma rede, e de que o disco da cópia de segurança está ligado. Em seguida, tente de novo efectuar a cópia de segurança.";

// BACKUP_FAILED_DISK_INTERRUPTION
RESULTCODE_27_MESSAGE = "O disco da cópia de segurança poderá ter sido ejectado ou desligado do seu computador.";

// BACKUP_FAILED_TARGETVOL_DISK_SPACE_DURING_BACKUP
RESULTCODE_28_MESSAGE = "O disco da cópia de segurança ficou sem espaço. O Time Machine tentará disponibilizar mais espaço, removendo as cópias de segurança caducadas aquando da próxima cópia de segurança programada.\n\n%@";
RESULTCODE_28_SHOWPREFS = "Abra as preferências do Time Machine para seleccionar um disco de cópia de segurança com maior capacidade, ou elimine alguns ficheiros para reduzir o tamanho da cópia de segurança."; 

// BACKUP_FAILED_AUTHENTICATION_ERROR
RESULTCODE_29_MESSAGE = "Não foi possível aceder ao disco da cópia de segurança em rede devido a um problema com o nome de utilizador ou a palavra-passe da rede.\n\n%@";
RESULTCODE_29_SHOWPREFS = "Abra as preferências do Time Machine para seleccionar o disco de cópia de segurança em rede e volte a digitar o nome de utilizador e palavra-passe correctos.";

// BACKUP_FAILED_UNABLE_TO_REUSE_BACKUP
RESULTCODE_30_MESSAGE = "Ocorreu um erro ao tentar reutilizar a cópia de segurança “%@”.";

// BACKUP_FAILED_DISK_IMAGE_BUSY
RESULTCODE_31_MESSAGE = "A imagem do disco de cópia de segurança “%@” já está a ser utilizada.";

// BACKUP_FAILED_DISK_IMAGE_NOT_FOUND
RESULTCODE_32_MESSAGE = "Não foi possível encontrar a imagem do disco de cópia de segurança “%@”.";

// BACKUP_FAILED_CLOCK_WRONG
RESULTCODE_33_MESSAGE = "A data e a hora do sistema estão incorrectas.";

// BACKUP_FAILED_NO_PRIMARY_NETWORK_INTERFACE
RESULTCODE_34_MESSAGE = "O computador não tem uma interface de rede primária.";

// BACKUP_FAILED_BOOT_COOKIE_NOT_FOUND
RESULTCODE_35_MESSAGE = "Não foram encontradas algumas definições do Time Machine.\n\n%@";
RESULTCODE_35_SHOWPREFS = "Para restabelecer as definições do Time Machine, abra as respectivas preferências e volte a seleccionar o disco da cópia de segurança.";

// BACKUP_FAILED_DESTINATION_COOKIE_NOT_FOUND
RESULTCODE_36_MESSAGE = "Algumas das definições do Time Machine não foram encontradas no disco da cópia de segurança “%@”.\n\nCertifique-se de que o disco da cópia de segurança está ligado e que os outros discos ligados não têm o mesmo nome que o disco da cópia de segurança.\n\n%@";
RESULTCODE_36_SHOWPREFS = "Para restabelecer as definições do Time Machine, abra as respectivas preferências e volte a seleccionar o disco da cópia de segurança.";

// BACKUP_FAILED_DISK_SOURCE_INTERRUPTION
RESULTCODE_37_MESSAGE = "Um dos discos para os quais estão a ser efectuadas cópias de segurança poderá ter sido ejectado ou desligado do seu computador.";

// BACKUP_FAILED_TARGETIMAGE_READONLY
RESULTCODE_38_MESSAGE = "O Time Machine não pode usar a imagem de disco, porque não é gravável.";

// BACKUP_HC_FAILED_TARGETVOL_RESOLUTION_FAILED
RESULTCODE_40_HEADER = "O Time Machine não conseguiu verificar as cópias de segurança, porque o disco de cópia de segurança não está disponível.";
RESULTCODE_40_MESSAGE = "Certifique‑se de que o computador e o disco de cópia de segurança se encontram na mesma rede, e de que o disco de cópia de segurança está ligado. Em seguida, volte a tentar verificar as cópias de segurança.";

// BACKUP_HC_FAILED_TARGETVOL_READONLY
RESULTCODE_41_HEADER = "Time Machine não conseguiu verificar as cópias de segurança.";
RESULTCODE_41_MESSAGE = "O disco de cópia de segurança parece ser “só de leitura”.";

// BACKUP_HC_VERIFICATION_INTERRUPTED
RESULTCODE_42_HEADER = "O Time Machine não conseguiu verificar as cópias de segurança, porque a verificação foi interrompida.";
RESULTCODE_42_MESSAGE = "As interrupções são normalmente causadas por problemas de rede. Volte a tentar depois de os mesmos estarem resolvidos.";

// BACKUP_FAILED_TO_ABANDON_IMAGE
RESULTCODE_43_MESSAGE = "O Time Machine não conseguiu mover a imagem de disco da cópia de segurança existente “%@”";

// BACKUP_FAILED_TO_DELETE_IMAGE
RESULTCODE_44_MESSAGE = "O Time Machine não conseguiu apagar a imagem de disco da cópia de segurança “%@”";

// BACKUP_FAILED_UNKNOWN
RESULTCODE_999_MESSAGE = "Código do erro: %@";

// BACKUP_WARNING_LOW_DISK_MESSAGE
RESULTCODE_1000_HEADER = "O disco de cópia de segurança está quase cheio.";
RESULTCODE_1000_MESSAGE = "Quando o disco da cópia de segurança está cheio, o Time Machine apaga as cópias de segurança antigas para disponibilizar espaço para novas.\n\n%@";
RESULTCODE_1000_SHOWPREFS = "Se preferir manter todas as cópias de segurança antigas, abra as preferências do Time Machine para seleccionar um novo disco de cópia de segurança.";

// BACKUP_WARNING_THINNING_START
RESULTCODE_1001_HEADER = "O disco de cópia de segurança está cheio.";
RESULTCODE_1001_MESSAGE = "O Time Machine apagou uma ou mais cópias de segurança antigas para libertar espaço para novas. A cópia de segurança mais antiga que está disponível é: %@\n\n%@";
RESULTCODE_1001_SHOWPREFS = "Para evitar a eliminação de cópias de segurança antigas, abra as preferências do Time Machine para seleccionar outro disco de cópia de segurança."; 
RESULTCODE_1001_CHECKBOX = "Não mostrar este aviso novamente.";

// BACKUP_WARNING_NO_RECENT_BACKUPS
RESULTCODE_1002_MESSAGE = "O Time Machine não efectuou qualquer cópia de segurança do computador nos últimos %@ dias.\n\n%@"; 
RESULTCODE_1002_SHOWPREFS = "Certifique-se de que o disco de cópia de segurança está disponível, ou abra as preferências do Time Machine, para seleccionar outro disco de cópia de segurança.";

// BACKUP_WARNING_REUSE_BACKUPS
RESULTCODE_1003_HEADER = "Gostaria de reutilizar a cópia de segurança “%@” neste computador?";
RESULTCODE_1003_MESSAGE = "A cópia de segurança foi criada noutro computador. Se reutilizar esta cópia de segurança, ela não poderá voltar a ser usada pelo computador original.";
REUSE_BACKUP_BUTTON = "Reutilizar cópia de segurança";
CREATE_NEW_BACKUP_BUTTON = "Criar cópia de segurança";
ASK_LATER_BUTTON = "Não efectuar agora";

// BACKUP_WARNING_FIRMWARE 
RESULTCODE_1004_HEADER = "Está disponível uma actualização para “%@.”";
RESULTCODE_1004_MESSAGE = "Esta actualização melhora a fiabilidade do Time Capsule. Para instalá-la, abra o Utilitário AirPort. É possível que tenha de introduzir a palavra‑passe do Time Capsule de “%@.”";
REMIND_LATER_BUTTON = "Actualizar depois";
AIRPORT_UTILITY_BUTTON = "Abrir o Utilitário AirPort…";

// BACKUP_WARNING_DELETE_IMAGE 
RESULTCODE_1006_HEADER = "O Time Machine conclui a verificação das suas cópias de segurança. Para melhorar a respectiva fiabilidade, o Time Machine tem de criar uma nova cópia de segurança.";
RESULTCODE_1006_MESSAGE = "Para iniciar uma nova cópia de segurança, clique em Efectuar agora. O histórico de salvaguarda será, assim, removido. A nova cópia de segurança pode demorar várias horas.\n\nClique em Efectuar mais tarde, para receber um aviso daqui a 24 horas. Até lá, o Time Machine não efectuará cópias de segurança.";
CREATE_RECOVERY_IMAGE_NOW_BUTTON = "Efectuar agora";
CREATE_RECOVERY_IMAGE_ASK_LATER_BUTTON = "Efectuar mais tarde";

// BACKUP_WARNING_TARGETVOL_CHANGED
RESULTCODE_1008_HEADER = "A identidade do disco da cópia de segurança foi alterada desde a última cópia de segurança.";
RESULTCODE_1008_MESSAGE = "O disco pode ter sido substituído ou apagado, ou alguém está a tentar fazer com que o computador crie uma cópia de segurança no disco errado.";
BACKUP_WARNING_TARGETVOL_CHANGED_OK_BUTTON = "Usar este disco";
BACKUP_WARNING_TARGETVOL_CHANGED_CANCEL_BUTTON = "Não fazer cópia de segurança";

// UNITS
KB = "KB";
MB = "MB";
GB = "GB";
TB = "TB";
